---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonMomentOfInertiaWeakAxis
source: html/847cf7e1-815d-2b9f-a14b-b5d3ea85bfde.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonMomentOfInertiaWeakAxis Property

"Moment of Inertia weak axis"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonMomentOfInertiaWeakAxis { get; }
```